{
    "DEMAND":[
        {
            "FOOD": "The monthly wage of a crew member is 10€. This is considered a good wage, as their work is highly skilled and dangerous. Assuming a crew member supports a family of 5, each person effectively lives on 2€ per month — a good standard. Refer to Society.json for the average monthly income. If food accounts for 50% of an average person's income (3.235€), that translates to 1.6175€ per person per month. This implies that each person needs 1.6175€/20 = 0.080875, or 8.09% of a unit of food per month to survive. Therefore, one unit of food must be substantial. If we assume the average person consumes 50 kg of food per month (which aligns with real-world averages of 45-50 kg), then a unit of food represents 50kg*(1/0.08425) = 618,238kg. A single unit of food could thus sustain 12.36476 people for one month, or approximately 370.1 people for a day. From this, we can derive that a population of 1,000 requires 2.696 units of food per day. Generalizing this, the daily food demand scales with population as: (2.696*Math.pow(10, size - 3)). At population size 3 (1,000 people): 2.696 unit/day. At population size 4 (10,000 people): ~26.96 units/day And so on.",
            "DOMESTIC_GOODS": "Domestics cost 50€ per unit — 2.5 times more expensive than food. This is significant, as the price of labor is primarily determined by the cost of food. Therefore, the price of all goods must reflect the value and rarity of the inputs required to produce them, the capital involved, and the cost of labor. Note that base prices do not account for supply and demand. According to the game, the demand for Domestics is ten times lower than that of food. If a person consumes 8.09% of a unit of food per day, they would consume 0.809% of a unit of Domestics per day. At a base price of 50€, this translates to 0.4045€ spent per person per month, or 12.504% of an average person's income. However, we assume that spending on domestic goods will increase in the future. Let's estimate it at 25% of a person's monthly income — or 0.80875€ per month per person. If one unit of Domestics costs 50€, and each person spends 0.80875€ per month, then a single unit can support 61.8238 people per month — or 1854.71 people per day. Therefore, a population of 1,000 would consume approximately 0.53916 units per day. Generalizing this, daily demand for Domestics is calculated as: (0.53916*Math.pow(10, size - 3))",
            "LUXURY_GOODS": "Costing 100€, luxury goods cannot be afforded by many. Thus it should only take 5% of an average person's income. That means 0.16175€ per person per month. Therefore each person consumes 0.16175/100 = 0.16175% of a luxury good. A luxury good can satisfy 618.238 people for a month or 18547.14 people for a day. Thus a 1000 people would demand 5.39% of a luxury good per day and 10k would demand 53.9167% of a luxury good per day. The formula is thus: (0.0539*Math.pow(10, size - 3))",
            "SUPPLIES": "With a cost of 100€, supplies are expensive yet necessary for the maintenance of ones property. Thus it takes 10% of an average person's income. That means 0.3235€ per person per month. Therefore each person consumes 0.3235/100 = 0.3235% of a supplies per month. A supply can thus satisfy 309.12 people for a month or 9273.57 people for a day. Thus a 1000 people would demand 10.784% of a supply per day and 10k would demand 1.0784 units of supplies per day. The formula is thus: (1.0784*Math.pow(10, size - 3))",
            "DRUGS": "Addicting yet expensive, drugs can only really be afforded by the high echalons of society. The poorer stratas must make do with off-brand or homemade drugs. Therefore 7.5% of the average income is spent buying drugs. This equals roughly to 0.2426€ per person per month. Thus a single person buys 1/824.317 th of a drug per month. Thus a single unit of drug can satisfy 824 people for a month or 24729.52 people for a day. A Thousand people consume 4.04375% of a single unit of drug per day. Thus the formula: (0.04044*Math.pow(10, size - 3))",
            "ORGANS": "Only acquired en mass through illegal means and highly desired given the radiation-rich enviroment and highly hazardous enviroment that the sector offers, organs are expensive and also only affordable by the rich. As a result 2.5% of the average income is spent buying organs. This equals roughly to 0.080875€ per person per month. Thus a single person buys 1/3709.428 th of an organ per month. Thus a single unit of organ can satisfy 3709 people for a month or 111282.844 people for a day. A Thousand people consume 0.8986% of a single unit of organ per day. Thus the formula: (0.008986*Math.pow(10, size - 3))"
        }
    ]
}