{
    "DEMAND":{
        "FOOD": "The monthly wage of a crew member is 10€. This is considered a good wage, as their work is both highly skilled and dangerous. Refer to Society.json for average monthly income and CommodityDimensions for unit definitions. A single unit of food weighs 1 ton. Since each person requires 50kg of food per month to survive (76kg in real life), one unit of food can feed 20 people per month, or 600 people per day. Therefore, a population of 1,000 would demand 5/3 units of food per day. This scales with population size using the formula: ((5/3) x Math.pow(10, size - 3)). If we make the BASE ASSUMPTION that the average person spends 50% of his income on food. This puts the average wage at 2€ per person per month. All the wages with the exception of marines and crewman will be derived from the BASE ASSUMPTION that people need to consume 50kg of food per month and need to spend half of their income on food!!! From the wiki, it is known that for a colony of size 4, 500 crew and 100 marines are produced each month. Their wages are constants. With these variables and my second BASE ASSUMPTION of class distribution under Society.json, we arrive at the wages of other classes. Refer to Society.json for these wages",
        "DOMESTIC_GOODS": "Domestics cost 50€ per unit — 2.5 times more expensive than food. This is significant, as the price of labor is primarily determined by the cost of food. Therefore, the price of all goods must reflect the value and rarity of the inputs required to produce them, the capital involved, and the cost of labor. Note that base prices do not account for supply and demand. According to the game, the demand for Domestics is ten times lower than that of food. If a person consumes 5% of a unit of food per month, they would consume 0.5% of a unit of Domestics per month. At a base price of 50€, this translates to 0.25€ spent per person per month, or 12.5% of an average person's income. However, we assume that spending on domestic goods will increase in the future. Let's estimate it at 25% of a person's monthly income — or 0.5€ per month per person. If one unit of Domestics costs 50€, and each person spends 0.5€ per month, then a single unit can support 100 people per month — or 3000 people per day. Therefore, a population of 1,000 would consume approximately 1/3 units per day. Generalizing this, daily demand for Domestics is calculated as: ((1/3)*Math.pow(10, size - 3))",
        "LUXURY_GOODS": "Costing 100€, luxury goods cannot be afforded by many. Thus it should only take 5% of an average person's income. That means 0.1€ per person per month. Therefore each person consumes 0.1/100 = 0.1% of a luxury good. A luxury good can thus satisfy 1000 people for a month or 30000 people for a day. Thus a 1000 people would demand 1/30 of a luxury good per day and 10k would demand 1/3 of a luxury good per day. The formula is thus: ((1/30)*Math.pow(10, size - 3))",
        "SUPPLIES": "With a cost of 100€, supplies are expensive yet necessary for the maintenance of ones property. Thus it takes 10% of an average person's income. That means 0.2€ per person per month. Therefore each person consumes 0.2/100 = 0.2% of supplies per month. A supply can thus satisfy 500 people for a month or 15000 people for a day. Thus a 1000 people would demand 1/15 unit of a supply per day and 10k would demand 2/3 units of supplies per day. The formula is thus: ((1/15)*Math.pow(10, size - 3))",
        "DRUGS": "Addicting yet expensive, drugs can only really be afforded by the high echelons of society. The poorer strata must make do with off-brand or homemade drugs. Therefore 7.5% of the average income is spent buying drugs. This equals roughly to 0.15€ per person per month. Thus a single person buys 3/4000 of a drug per month. Thus a single unit of drug can satisfy 1333.33 people for a month or 40k people for a day. A Thousand people consume 2.5% of a single unit of drug per day. Thus the formula: (0.025*Math.pow(10, size - 3))",
        "ORGANS": "In the world. Around 150k organs are donated each year: https://www.who.int/news/item/30-05-2024-seventy-seventh-world-health-assembly---daily-update--30-may-2024. This satisfies about 10-9% of global demand. We can generalize and say that each organ weighs a kilo: https://www.verywellhealth.com/how-much-do-your-organs-weigh-4105246. This makes a single unit of organ in Starsector, excluding containers and other jazz, hold 1000 organs. If we account for containers and fluids, a modern container weighs around 12.5kg: https://nhsbtdbe.blob.core.windows.net/umbraco-assets-corp/4382/organ_boxes_instructions_for_use.pdf. Thus a unit of organ is actually around 80 organs and costs 300 credits. The average wage is 2€. Each organ costs (300/80) 3.75€ credits. Thus two months wage can let one buy a single piece of organ. This makes the organs cheap in this Starsector. This makes  sense, as inside the dystopian universe, organ harvesting is a common practice. If we divide the 1.5M organ demand per year by 365 to get the daily figure and divide that figure by 8000 to get the daily organ need for 1 million people, that is equal to 0.513699 organs per day per 1 million people. Since each unit of organ contains 80 organs, that makes 0.00642 units of organs per day per 1M people. Translating the real-life figure of 0.00642 units of organs per day per 1M people to the Starsector universe, one must account for the abundant supply of organs, the radiation-rich and highly hazardous enviroment and the lack of a coherent governing body. Let us assume that the demand is doubled due to enviromental hazards, doubled due to a lack of law enforcement and quintupled due to access to easy supply. This nets a figure of 0.1284 units of organs per day per 1M people. This is approximitely 3/23360 units per day per thousand people. Thus the formula ((3/233)*Math.pow(10, size - 5)). This means the new monthly spending on organs is 0.00116€ per month per person. Fifty times smaller than the ORGANS_OLD spending. That is about 0.058% of a 2€ average wage.",
        "ORGANICS": "Provided by the state for the people, organics are bulk, unprocessed biomass and carbon-based materials. They are used by light-industry to produce its commodities, including drugs, and demanded by planets with inhospitable conditions. In short, bulk carbon feedstock. Their demand is smaller by a factor of 10 than food and their unit price is 30€. This means each person needs 5kg of organics per month. 1 unit of organics (1 ton) satisfies 200 people for a month or 6000 people for a day. Thus a colony of 1000 people would demand 1/6 of a unit of organics while a colony of 10k would demand 10/6 units of organics. Thus the formula: ((1/6)*Math.pow(10, size - 3))"
    },
    "SUPPLY": {
        "CREW": "5% of the population are crewmen. The vanilla game logic produces 50 x 10^(size - 3) crew per month. This assumes a rapid replenishment rate. In this society, we apply stricter population dynamics. 30% of the population are non-workers (students, retirees, etc). Graduation rate is 4% (realistic is ~1.67%) of non-workers per year, or 1/25 per year — or roughly 1/(25 x 365) per day. Of the daily graduates, only 5% become crewmen. This means only a small trickle of new crew enters the labor pool daily 1/(25 x 365 x 20). Thus, crew production is set at ((3000/(25*365*20*10)) x 10^(size - 3)) per day — or 8.22 crew per day per 10 Million people. This astronomically rarer than in vanilla — as it should be.",
        "DRUGS": "Vanilla infra would supply drugs via supply(Commodities.DRUGS, size - 4) → 100 x 10^(size - 4) units per month ≈ 10^(size - 2). Since we want actual production to be two orders of magnitude smaller than demand, and demand is (0.025 x 10^(size - 3)), actual drug supply becomes (0.025/100) x 10^(size - 3) = 0.00025 x 10^(size - 3) units per month. In other words: (int)((0.00025) x Math.pow(10, size - 3)).",
        "ORGANS": "Around 9% to 10% of organ demand is satisfied in the real world. This number is doubled for the Starsector universe to compensate for the increased illegal organ harvesting to 20% or 3/116800 units per day per thousand. The formula is then: ((3/1168)*Math.pow(10, size - 5))"
    }
}